import numpy as np

m = np.array([[0, 50, 75, 100, 150, 200, 250,
               3, 0.02, 0.05, 0.1, 0.16, 0.24, 0.2,
               7, 0.05, 0.11, 0.21, 0.31, 0.46, 0.6,
               10, 0.06, 0.13, 0.25, 0.37, 0.55, 0.7,
               15, 0.08, 0.17, 0.31, 0.46, 0.69, 1.0,
               20, 0.09, 0.2, 0.37, 0.53, 0.8, 1.1,
               25, 0.1, 0.22, 0.42, 0.59, 0.9, 1.3,
               30, 0.11, 0.24, 0.45, 0.62, 0.9, 1.4,
               40, 0.12, 0.28, 0.52, 0.69, 1.1, 1.6,
               50, 0.13, 0.31, 0.58, 0.8, 1.2, 1.9,
               70, 0.14, 0.36, 0.68, 0.8, 1.3, 2.0,
               100, 0.16, 0.41, 0.8, 1.0, 1.5, 2.4,
               150, 0.2, 0.5, 0.9, 1.1, 1.7, 2.7,
               200, 0.2, 0.5, 1.0, 1.2, 1.8, 3.0,
               300, 0.3, 0.6, 1.1, 1.4, 2.0, 3.5,
               400, 0.3, 0.7, 1.2, 1.5, 2.2, 3.8,
               600, 0.3, 0.75, 1.3, 1.7, 2.4, 4.2,
               800, 0.3, 0.8, 1.4, 1.7, 2.5, 4.5,
               1000, 0.3, 0.8, 1.5, 1.8, 2.6, 4.7,
               1500, 0.4, 0.9, 1.6, 2.0, 2.8, 5.2,
               2000, 0.4, 1.0, 1.7, 2.1, 3.0, 5.6,
               2500, 0.4, 1.0, 1.8, 2.2, 3.1, 5.8,
               3000, 0.4, 1.1, 1.9, 2.3, 3.2, 6.0,
               4000, 0.45, 1.1, 2.0, 2.4, 3.35, 6.2,
               5000, 0.5, 1.15, 2.1, 2.5, 3.5, 6.6,
               6000, 0.5, 1.2, 2.2, 2.6, 3.6, 6.8,
               10000, 0.5, 1.3, 2.3, 2.75, 3.9, 7.4,
               12000, 0.5, 1.3, 2.4, 2.85, 4.0, 7.6,
               15000, 0.55, 1.35, 2.5, 2.95, 4.1, 7.8,
               20000, 0.6, 1.4, 2.6, 3.1, 4.3, 8.1,
               30000, 0.6, 1.5, 2.7, 3.2, 4.5, 8.6,
               40000, 0.65, 1.6, 2.85, 3.3, 4.7, 9.0,
               50000, 0.65, 1.65, 2.9, 3.4, 4.8, 9.2,
               60000, 0.65, 1.65, 3.0, 3.5, 4.9, 9.4,
               100000, 0.7, 1.8, 3.2, 3.7, 5.2, 10.0,
               200000, 0.75, 1.9, 3.4, 4.0, 5.6, 11.0,
               300000, 0.8, 2.0, 3.6, 4.2, 5.8, 11.4,
               500000, 0.8, 2.2, 3.8, 4.4, 6.1, 12.0,
               1000000, 0.9, 2.3, 4.0, 4.7, 6.5, 13.0,
               1500000, 0.9, 2.3, 4.2, 4.8, 6.7, 13.4,
               3000000, 1.0, 2.5, 4.4, 5.1, 7.1, 14.2,
               5000000, 1.0, 2.6, 4.6, 5.3, 7.4, 15.0,
               10000000, 1.1, 2.8, 4.9, 5.6, 7.8, 15.8
               ]])
m = np.reshape(m, (43, 7))

kvp = int(input('Введите kVp: '))

running = int(input('Сколько раз ввести K: '))
for v in range(running):
    if v != running:
        k = int(input('Введите K: '))
        kvlist = (m[0, :]).tolist()

        for kv in range(len(kvlist)):
            if kvlist[kv] >= kvp:
                break
        kvp1 = kvlist[kv - 1]
        kvp2 = kvlist[kv]

        klist = (m[:, 0]).tolist()

        for i in range(len(klist)):
            if klist[i] >= k:
                break
        k1 = klist[i - 1]
        k2 = klist[i]

        kvp1list = (m[1:, kv - 1:kv]).tolist()
        kvp2list = (m[1:, kv:kv + 1]).tolist()


        def kv_interpolation(kvp1list, kvp2list):
            kvplist = []
            for i in range(len(kvp1list)):
                for k in range(len(kvp2list)):
                    if i == k:
                        d = kvp1list[i][0] - (kvp1list[i][0] - kvp2list[k][0]) * (kvp - kvp1) / (kvp2 - kvp1)
                        kvplist.append(d)
            return kvplist


        def k_interpolation(klist, kv_interpolation):
            for w in range(len(kv_interpolation)):
                if klist.index(k1) == w + 1:
                    thickness = kv_interpolation[w] - (kv_interpolation[w] - kv_interpolation[w + 1]) * (k - k1) / (k2 - k1)
            return thickness


        print(round(k_interpolation(klist, kv_interpolation(kvp1list, kvp2list)), 2), 'mm Pb')
print(input('Для выхода нажмите Enter...'))
